[
    {
        "topic": "WW1",
        "topicNum": "1",
        "question": "What were some of the key events in WW2? Can you find out the dates of events, countries involved and important military strategies used?",
        "clue1": "In the Pacific, the United States and its allies continued their island-hopping campaign, pushing Japanese forces back towards the Japanese home islands. Eventually, Japan surrendered to USA after the atomic bomb was dropped on Hiroshima and Nagasaki, ending WW2.",
        "clue2":"Germany's invasion of Poland led to the British prime minister declaring war, starting WW2 in 1939.",
        "clue3": "Japanese forces invaded and captured the British colony of Hong Kong. The battle resulted in the surrender of British and Canadian forces in 1941, marking the beginning of Japanese occupation in Southeast Asia.",
        "clue4":"Hitler begins Operation Barbarossa in 1941, the same year another major conflict starts between two countries, using the Blitzkrieg strategy.",
        "clue5":"During World War II, Japanese pilots employed the tactic of executing deliberate suicidal crashes, commonly known as kamikaze attacks, targeting enemy positions.",
        "clue6":"In August 1939, discussions in Moscow led to the signing of the German-Soviet Nonaggression Pact. A secret protocol within the pact outlined the division of Poland between Germany and the Soviet Union. A week later, Hitler issued orders to commence hostilities against Poland, marking the beginning of the invasion.",
        "question1": "Why did Hitler decide to invade Poland?",
        "question2": "Of the events listed, which has the most influence in Hitler losing the War?",
        "question3": "What motives were behind the United States’ decision to use atomic bombs against Japan?",
        "answer1a": "One of his primary goals was to expand German territory",
        "answer1b": "The strategic advantages of controlling Poland",
        "answer1c": "Soviet-Nazi Pact (Molotov-Ribbentrop Pact)",
        "answer1d": "He viewed the Treaty of Versailles as punitive and unjust",
        "answer2a": "The Halt Order at Dunkirk",
        "answer2b": "The Battle of Britain ",
        "answer2c": "The invasion of Greece",
        "answer2d": "Operation Barbarossa",
        "answer3a": "To keep the Soviets out of Japan",
        "answer3b": "Japan’s unwillingness to surrender unconditionally",
        "answer3c": "To avoid committing themselves to a land invasion",
        "answer3d": "The expectations of the American public",
        "reason1a": "He sought to unite all German-speaking people into a Greater Germany and to acquire territory in Eastern Europe for agricultural and strategic purposes.",
        "reason1b": "The strategic advantages included a more defensible eastern border and the ability to stage future military operations in the East. This was part of Hitler's broader plan for territorial expansion and dominance in Europe.",
        "reason1c": "Germany signed a non-aggression pact with the Soviet Union, which included a secret protocol dividing Eastern Europe into spheres of influence. This pact ensured that the Soviet Union would not interfere with German actions in the West.",
        "reason1d": "The treaty imposed severe economic and territorial restrictions on Germany. Hitler sought to overturn the treaty's provisions.",
        "reason2a": "Given that Britain was in a vulnerable position, if the halt order wasn’t issued, they would’ve been devasted by the battle - making it unlikely for Britain to win future battles.",
        "reason2b": "Had Germany won, Hitler would’ve been on the cusp of consolidating his hold over Europe.",
        "reason2c": "This last-minute attack on Greece cause delays in their plans and led to their lack of preparedness for Operation Barbarossa.",
        "reason2d": "Hitler did underestimate Russia, but the unexpected delay caused by the invasion of Greece lead to an even major loss.",
        "reason3a": "There was mounting distrust between USA and the Soviet Union. After getting word of Russia’s impending involvement in the war, they sought to end it quickly by whatever means.",
        "reason3b": "Despite many brutal attempts at making Japan surrender, Japan was still unwilling to wave the white flag. The US sought more extreme means of ending the war.",
        "reason3c": "Truman’s first-hand experiences with warfare made him very reluctant to put many American lives on the line in front-line combat. The atomic bomb served as a tool to bring the war to a close sooner.",
        "reason3d": "in its fourth year of war, the US public’s hostility towards Japan grew even more intense and demanded total victory – something of which Truman was acutely aware.",
        "h1a": "USA",
        "h1b": "Germany",
        "h1c": "Japan",
        "h2a": "1945",
        "h2b": "1939",
        "h2c": "1941",
        "h3a": "Atomic Bomb",
        "h3b": "Invasion",
        "h3c": "Secret Pact",
        "h4a": "Kamikaze",
        "h4b": "Blitzkrieg",
        "h4c": "Island hopping"
    }
    ]    